Updating diagrams to mermaid.
